<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px"> 

## Lab: SQL Practice

_Author: Matt Brems_

### Required Preparation

In order to run SQL queries within Python/this Jupyter notebook, you will need to install the following:

```bash
conda install sqlalchemy
conda install psycopg2
```

If you get an error trying to install `psycopg2`, you can install a stand-alone package (sufficient for everything you'll need to complete this lab) by entering the following anywhere in the terminal: 

```bash 
pip install psycopg2-binary
```

(If `pip` doesn't work for you, try `pip3 install psycopg2-binary`.)

### Instructions

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the Iowa liquor database. It contains various tables of transactions. The schema for this database is here:

<img src="./images/schema.png" alt="schema" width="750"/>

In [1]:
# Import Pandas and Create_Engine

import pandas as pd
from sqlalchemy import create_engine

# Set up the engine to access the data.
engine = create_engine('postgresql://analytics_student:analyticsga@analyticsga-psql.generalassemb.ly:5432/iowa_liquor_sales_database')

### Prompt 1

How many rows are there in the `stores` table of the Iowa liquor database?

In [2]:
# check what tables are there
sql = ("""
SELECT table_name FROM information_schema.tables
       WHERE table_schema = 'public'
       """)
pd.read_sql_query(sql, engine)

  table_name
0   counties
1   products
2      sales
3     stores

In [3]:
sql = ("""
SELECT 
   table_name, 
   column_name, 
   is_nullable,
   data_type 
FROM 
   information_schema.columns
   WHERE table_schema = 'public'
""")

pd.read_sql_query(sql, engine)

   table_name        column_name is_nullable                    data_type
0    counties             county          NO                         text
1    counties         population         YES                      integer
2    products            item_no          NO                      integer
3    products      category_name         YES                         text
4    products   item_description         YES                         text
5    products             vendor         YES                      integer
6    products        vendor_name         YES                         text
7    products        bottle_size         YES                      integer
8    products               pack         YES                      integer
9    products         inner_pack         YES                      integer
10   products                age         YES                         text
11   products              proof         YES                         text
12   products          list_date         YES  timestamp without time zone
13   products                upc         YES                         text
14   products                scc         YES                         text
15   products       bottle_price         YES                        money
16   products        shelf_price         YES                      numeric
17   products          case_cost         YES                      numeric
18      sales               date         YES  timestamp without time zone
19      sales  convenience_store         YES                         text
20      sales              store         YES                      integer
21      sales      county_number         YES                         text
22      sales             county         YES                         text
23      sales           category         YES                         text
24      sales      category_name         YES                         text
25      sales          vendor_no         YES                         text
26      sales             vendor         YES                         text
27      sales               item         YES                      integer
28      sales        description         YES                         text
29      sales               pack         YES                      integer
30      sales         liter_size         YES                      integer
31      sales     state_btl_cost         YES                        money
32      sales          btl_price         YES                        money
33      sales         bottle_qty         YES                      integer
34      sales              total         YES                      numeric
35     stores              store          NO                      integer
36     stores               name         YES                         text
37     stores       store_status         YES                         text
38     stores      store_address         YES                         text
39     stores       address_info         YES                         text

In [4]:
# Use a SQL query to find the answer to the above prompt.

sql = """
select count(*) from stores
"""

pd.read_sql_query(sql, engine)

   count
0   1973

**Prompt 1 Answer**:

### Prompt 2

If you sort the stores in alphabetical order by name, which store is fourth?

In [5]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT * 
FROM stores
ORDER BY name
LIMIT 4;
"""

pd.read_sql_query(sql, engine)

,store,name,store_status,store_address,address_info
0,4986,218 Fuel Express & Chubby's Liquor,A,"68 Monroe St\nFloyd, IA 50435\n(43.12249790500...",None
1,3047,3047 Cub Foods / Iowa City,I,"855 Highway 1 West\nIowa City, IA 522460000\n(...",None
2,3060,3060 Cub Foods / Ames,I,"3121 Grand Ave\nAmes, IA 500100000\n(42.053458...",None
3,3061,3061 Cub Foods / Sioux City,I,"1732 Hamilton Blvd\nSioux City, IA 511030000\n...",None

In [6]:
sql = """
select B.name from 
(SELECT *, row_number() over (order by name) as num FROM stores) B
where B.num=4;
"""

pd.read_sql_query(sql, engine)

                          name
0  3061 Cub Foods / Sioux City

In [50]:
sql = """
with B as (SELECT *, row_number() over (order by name) as num FROM stores)

select name from B where num=4;
"""

pd.read_sql_query(sql, engine)

                          name
0  3061 Cub Foods / Sioux City

**Prompt 2 Answer**:

### Prompt 3

Among those sales whose category name is `IMPORTED VODKA`, if you sort by vendor in alphabetical order, what is the bottle price and number of bottles bought in the first 3 transactions?
> You should give us three sets of numbers - one for each transaction.

In [7]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT btl_price, bottle_qty
FROM sales
WHERE category_name = 'IMPORTED VODKA'
ORDER BY vendor ASC
LIMIT 3;
"""

pd.read_sql_query(sql, engine)

  btl_price  bottle_qty
0     $8.99          12
1    $28.50           6
2    $28.50           6

**Prompt 3 Answer**:

### Prompt 4

What is the total amount of liquor sold in February 2015?

In [8]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT SUM(total)
FROM sales
WHERE date>='2-1-2015' AND date<'3-1-2015';
"""
pd.read_sql_query(sql, engine)

           sum
0  21295350.55

In [7]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT SUM(total)
FROM sales
WHERE date>=to_date('01-02-2015','DD-MM-YYYY') AND date<to_date('01-03-2015','DD-MM-YYYY');
"""
pd.read_sql_query(sql, engine)

           sum
0  21295350.55

In [8]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT SUM(total)
FROM sales
WHERE extract(month from date)=2 AND extract(year from date)=2015;
"""
pd.read_sql_query(sql, engine)

           sum
0  21295350.55

**Prompt 4 Answer**:

### Prompt 5

Among all transactions where `IMPORTED VODKA` was sold, which vendor has the most transactions? Report the total number of transactions, the number of bottles sold, and the total amount of revenue from these transactions. Rename the columns to make sure there isn't any confusion as to what they mean!

In [15]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT vendor, COUNT(*) AS "Number of Transactions", SUM(bottle_qty) AS "Number of Bottles", SUM(total) AS "Total Revenue"
FROM sales
WHERE category_name = 'IMPORTED VODKA'
GROUP BY vendor
ORDER BY "Number of Transactions" DESC
limit 1;
"""

pd.read_sql_query(sql, engine)

,vendor,Number of Transactions,Number of Bottles,Total Revenue
0,Pernod Ricard USA/Austin Nichols,42338,403450,7880365.88

**Prompt 5 Answer**:

### Prompt 6

The reason we sell things is to make money. In sales, the term **markup** means the amount of extra money charged for a product over the cost to make that product. (You can think of the markup as the profit for that product.)

In Iowa, the law states the minimum price at which liquor may be sold.

Calculate the markup (name this `Markup`) that shows the difference between the `btl_price` and the `state_btl_cost`. 

> If you haven't subtracted columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [14]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT btl_price - state_btl_cost AS "Markup"
FROM sales
limit 5;
"""

pd.read_sql_query(sql, engine)

  Markup
0  $5.75
1  $5.75
2  $5.75
3  $8.58
4  $2.50

### Prompt 7

Calculate the "Percentage Markup" by dividing markup by the state bottle cost. (Rather than the total profit per bottle, this will tell you how much stores are increasing their price over the state minimum.)

After calculating the "Percentage Markup," calculate the average percentage markup per **store**. Which store has the largest average markup, and what is that average markup?

In [35]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT store, ROUND(cast(AVG((btl_price - state_btl_cost) / state_btl_cost) as decimal),2) AS "Percentage Markup"
FROM sales
GROUP BY store
ORDER BY "Percentage Markup" DESC
limit 1;
"""

pd.read_sql_query(sql, engine)

   store  Percentage Markup
0   4013               0.53

**Prompt 7 Answer**:

### Prompt 8

Building off of your last query, retrieve the five stores with the highest average markup percentage. Along with the store IDs and average markup percentage, please return the minimum and maximum markup percentage for those stores, as well as the names and addresses of those store.

What are the names of the five stores?

In [25]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT sales.store, AVG((sales.btl_price - sales.state_btl_cost) / sales.state_btl_cost) AS "Percentage Markup", stores.name, stores.store_address
FROM sales 
    LEFT JOIN stores
    ON sales.store = stores.store
GROUP BY sales.store, stores.name, stores.store_address
ORDER BY "Percentage Markup" DESC
LIMIT 5;
"""

pd.read_sql_query(sql, engine)

,store,Percentage Markup,name,store_address
0,4013,0.525471,Wal-Mart 0841 / Tipton,"1126 Highway 38 North\nTipton, IA 527720000\n(..."
1,4024,0.521499,Wal-Mart 1546 / Iowa Falls,"840 S Oak\nIowa Falls, IA 501260000\n(42.50295..."
2,4266,0.518903,Wal-Mart 1683 / Shenandoah,"705 S Fremont\nShenandoah, IA 516010000\n(40.7..."
3,3833,0.515094,Wal-Mart 3394 / Atlantic,"1905 East 7th St\nAtlantic, IA 500220000\n(41...."
4,3660,0.514591,Wal-Mart 2935 / Knoxville,"814 W Bell Ave\nKnoxville, IA 501380000\n(41.3..."

In [9]:
sql = """
select A.*,
S.name,S.store_address from 
(select distinct store,
round(cast(AVG((sales.btl_price - sales.state_btl_cost) / sales.state_btl_cost) over (partition by store) as decimal),2) as "avg_percentage_markup",
round(cast(min((sales.btl_price - sales.state_btl_cost) / sales.state_btl_cost) over (partition by store) as decimal),2)  as "min_percentage_markup",
round(cast(max((sales.btl_price - sales.state_btl_cost) / sales.state_btl_cost) over (partition by store) as decimal),2)  as "max_percentage_markup"
from sales) A
left join stores S on A.store=S.store
order by A.avg_percentage_markup DESC
limit 5;
"""

pd.read_sql_query(sql, engine)

,store,avg_percentage_markup,min_percentage_markup,max_percentage_markup,name,store_address
0,4013,0.53,0.5,6.71,Wal-Mart 0841 / Tipton,"1126 Highway 38 North\nTipton, IA 527720000\n(..."
1,4266,0.52,0.5,6.71,Wal-Mart 1683 / Shenandoah,"705 S Fremont\nShenandoah, IA 516010000\n(40.7..."
2,3833,0.52,0.5,6.71,Wal-Mart 3394 / Atlantic,"1905 East 7th St\nAtlantic, IA 500220000\n(41...."
3,4024,0.52,0.5,6.71,Wal-Mart 1546 / Iowa Falls,"840 S Oak\nIowa Falls, IA 501260000\n(42.50295..."
4,2668,0.51,0.5,0.69,Hy-Vee Food Store / Leon,"1004 W 1st St\nLeon, IA 50144\n(40.73967779500..."

**Prompt 8 Answer**:

### Prompt 9

Which nine counties sell the highest number of bottles of liquor per capita (per person)? Calculate the average bottle size of the bottles of liquor sold by these counties rounded to the nearest first decimal place. Of the nine counties selling the highest number of bottles of liquor per capita, which county sells (on average) the largest bottle size?

**_BONUS FUN_**: This question can (also) be solved with a SQL subquery - that is, a query that queries a query! If you'd like to give this a try, you can read more about it [here](https://www.dofactory.com/sql/subquery). Otherwise, keep an eye out for the solution key!

In [10]:
# Use a SQL query to find the answer to the above prompt.

sql_subquery = """
SELECT * FROM
    (SELECT counties.county, (SUM(bottle_qty) / counties.population) AS "Bottles Sold per Capita", ROUND(AVG(products.bottle_size),1) AS "Average Bottle Size"
    FROM counties
        LEFT JOIN sales
            LEFT JOIN products
            ON sales.item = products.item_no
        ON counties.county = sales.county
    GROUP BY counties.county
    ORDER BY "Bottles Sold per Capita" DESC
    LIMIT 9) as df
ORDER BY "Average Bottle Size" DESC
LIMIT 1;
"""

sql = """
SELECT counties.county, (SUM(bottle_qty) / counties.population) AS "Bottles Sold per Capita", ROUND(AVG(products.bottle_size),1) AS "Average Bottle Size"
FROM counties
    LEFT JOIN sales
        LEFT JOIN products
        ON sales.item = products.item_no
    ON counties.county = sales.county
GROUP BY counties.county
ORDER BY "Bottles Sold per Capita" DESC
LIMIT 9
"""

pd.read_sql_query(sql, engine)

          county  Bottles Sold per Capita  Average Bottle Size
0      Dickinson                       22                974.1
1           Polk                       15                892.6
2     Black Hawk                       15                862.9
3    Cerro Gordo                       14                986.4
4          Scott                       13                871.6
5        Johnson                       13                895.4
6           Linn                       12                886.3
7  Pottawattamie                       11                893.7
8        Kossuth                       11               1041.0

In [11]:
pd.read_sql_query(sql_subquery, engine)

    county  Bottles Sold per Capita  Average Bottle Size
0  Kossuth                       11               1041.0

In [12]:
df = pd.read_sql_query(sql, engine)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   county                   9 non-null      object
 1   Bottles Sold per Capita  9 non-null      int64
 2   Average Bottle Size      9 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 344.0+ bytes

In [16]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Bottles Sold per Capita,9.0,14.000000,3.354102,11.0,12.0,13.0,15.0,22.0
Average Bottle Size,9.0,922.666667,61.946590,862.9,886.3,893.7,974.1,1041.0

In [45]:
pd.read_sql_query(sql_subquery, engine)

    county  Bottles Sold per Capita  Average Bottle Size
0  Kossuth                       11               1041.0

**Prompt 9 Answer**:

### Prompt 10 (advanced but required!)

In the `sales` table, three columns are `btl_price`, `bottle_qty`, and `total`. The `total` for a transaction _should be_ the product of `btl_price` and `bottle_qty`. How many transactions have a value of `total` that is not equal to `btl_price` time `bottle_qty`?

> There will be a type error as well! We cannot compare type `money` to type `real`. We have to convert `total` to type `money` so that we can compare the two directly. [This link](https://docs.microsoft.com/en-us/sql/t-sql/functions/cast-and-convert-transact-sql?view=sql-server-ver15#syntax) may be helpful to you!

In [14]:
sql = ("""
SELECT 
   table_name, 
   column_name, 
   is_nullable,
   data_type 
FROM 
   information_schema.columns
   WHERE table_name = 'sales'
""")

pd.read_sql_query(sql, engine)

   table_name        column_name is_nullable                    data_type
0       sales               date         YES  timestamp without time zone
1       sales  convenience_store         YES                         text
2       sales              store         YES                      integer
3       sales      county_number         YES                         text
4       sales             county         YES                         text
5       sales           category         YES                         text
6       sales      category_name         YES                         text
7       sales          vendor_no         YES                         text
8       sales             vendor         YES                         text
9       sales               item         YES                      integer
10      sales        description         YES                         text
11      sales               pack         YES                      integer
12      sales         liter_size         YES                      integer
13      sales     state_btl_cost         YES                        money
14      sales          btl_price         YES                        money
15      sales         bottle_qty         YES                      integer
16      sales              total         YES                      numeric

In [47]:
# Use a SQL query to find the answer to the above prompt.

sql = """
SELECT COUNT(*)
FROM sales
WHERE CAST(total AS money) <> cast((btl_price * bottle_qty) as money);
"""

pd.read_sql_query(sql, engine)

   count
0      0

In [16]:
sql = """
SELECT COUNT(*)
FROM sales
WHERE total <> (btl_price * bottle_qty);
"""

pd.read_sql_query(sql, engine)

ProgrammingError: (psycopg2.errors.UndefinedFunction) operator does not exist: numeric <> money
LINE 4: WHERE total <> (btl_price * bottle_qty);
                    ^
HINT:  No operator matches the given name and argument types. You might need to add explicit type casts.

[SQL:
SELECT COUNT(*)
FROM sales
WHERE total <> (btl_price * bottle_qty);
]
(Background on this error at: http://sqlalche.me/e/14/f405)

**Prompt 10 Answer**:

In [17]:
%load_ext sql

In [18]:
#Set up the connection:

%sql $engine.url

In [19]:
%sql select * from sales limit 5

 * postgresql://analytics_student:***@analyticsga-psql.generalassemb.ly:5432/iowa_liquor_sales_database
5 rows affected.

[(datetime.datetime(2014, 11, 13, 0, 0), None, 2635, '82', 'Scott', '1032200', 'IMPORTED VODKA - MISC', '370', 'Pernod Ricard USA/Austin Nichols', 34036, 'Absolut Pears', 12, 750, '$11.49', '$17.24', 4, Decimal('68.96')),
 (datetime.datetime(2014, 11, 13, 0, 0), None, 2635, '82', 'Scott', '1032200', 'IMPORTED VODKA - MISC', '370', 'Pernod Ricard USA/Austin Nichols', 34076, 'Absolut Vanilia', 12, 750, '$11.49', '$17.24', 12, Decimal('206.88')),
 (datetime.datetime(2014, 11, 13, 0, 0), None, 2635, '82', 'Scott', '1032200', 'IMPORTED VODKA - MISC', '370', 'Pernod Ricard USA/Austin Nichols', 34116, 'Absolut Mandrin', 12, 750, '$11.49', '$17.24', 12, Decimal('206.88')),
 (datetime.datetime(2014, 11, 13, 0, 0), None, 2635, '82', 'Scott', '1032080', 'IMPORTED VODKA', '420', 'Moet Hennessy USA Inc.', 34155, 'Belvedere Vodka', 6, 750, '$17.15', '$25.73', 6, Decimal('154.38')),
 (datetime.datetime(2014, 11, 13, 0, 0), None, 2635, '82', 'Scott', '1032080', 'IMPORTED VODKA', '260', 'Diageo Americas', 34164, 'Ciroc Luxury Vodka', 24, 200, '$5.00', '$7.50', 6, Decimal('45.00'))]

In [20]:
%%sql

SELECT counties.county, (SUM(bottle_qty) / counties.population) AS "Bottles Sold per Capita", ROUND(AVG(products.bottle_size),1) AS "Average Bottle Size"
FROM counties
    LEFT JOIN sales
        LEFT JOIN products
        ON sales.item = products.item_no
    ON counties.county = sales.county
GROUP BY counties.county
ORDER BY "Bottles Sold per Capita" DESC
LIMIT 9

 * postgresql://analytics_student:***@analyticsga-psql.generalassemb.ly:5432/iowa_liquor_sales_database
9 rows affected.

[('Dickinson', 22, Decimal('974.1')),
 ('Polk', 15, Decimal('892.6')),
 ('Black Hawk', 15, Decimal('862.9')),
 ('Cerro Gordo', 14, Decimal('986.4')),
 ('Scott', 13, Decimal('871.6')),
 ('Johnson', 13, Decimal('895.4')),
 ('Linn', 12, Decimal('886.3')),
 ('Pottawattamie', 11, Decimal('893.7')),
 ('Kossuth', 11, Decimal('1041.0'))]